Documents/Requests/Soap_Getcustomerdetails_cable__25_02_2022_07_30_41_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/customer/VFDEGetCustomerDetails" xmlns:vfd1="http://amdocs/vfde/customer/VFDEGetCustomerDetailsInput">
    <soapenv:Header/>
    <soapenv:Body>
        <vfd:GetCustomerDetailsRequest>
            <vfd1:ROOT>
                <Event>
                    <Type>RetrieveCustomerInfo</Type>
                     <ID>4999b900-601c-4c58-83ca-6753720475de</ID>
                    <CallerID>OSF</CallerID>
                    <CorrelationID>06cf6aae-eb8c-4b8d-b325-f92c2ceefa88</CorrelationID>
                    <MessageCreationTimestamp>2022-02-23T05:42:59.419Z</MessageCreationTimestamp>
                </Event>
                <DATA>
                    <GlobalID>KD_</GlobalID>
                    <Mode>1</Mode>
                    <SourceSystemID> </SourceSystemID>
                    <Portal>{{portal}}</Portal>
                </DATA>
            </vfd1:ROOT>
        </vfd:GetCustomerDetailsRequest>
    </soapenv:Body>
</soapenv:Envelope>